<script>
	import Paragraph from './Paragraph.svelte';
	import Subheader from './Subheader.svelte';
</script>

<Subheader class="text-tertiary">연습하기</Subheader>
<Paragraph class="text-tertiary">
	공상적 세계화의 방법론을 적용할 수 있는 다양한 방법을 보여주는 디자인 연습 문제들
</Paragraph>
<Paragraph>
	<ol class="list-decimal text-tertiary pl-6">
		<li class="mb-2">
			나만의 개인 심볼 라이브러리를 만들어보세요. 각 심볼에 고유한 색상, 기질, 원소, 지배 행성, 향기, 음악 장르, 꽃의 종 등을 지정하세요. 어떤 상징이 다른 상징에 약하고, 어떤 상징이 서로 조화를 이루고 강화하며, 어떤 상징이 서로를 부정하고, 어떤 상징이 다른 상징보다 우세한가요?
		</li>
		<li class="mb-2">
			나의 세계를 지배하거나 나와 가장 관련성이 높은 여러 지식 체계, 분류 및 분류 체계를 오버레이 해보세요. 서로 어떻게 상호 작용하는지 살펴보세요. (예를 들어, 중국 철학의 5원소를 매핑한 다음 그 위에 토양 분류도를 오버레이한 다음 이 모든 것을 정치 나침반에 매핑해 보세요.)
		</li>
		<li class="mb-2">
			숫자는 원형적이며 다양한 차원의 의미를 갖는 경우가 많습니다. 예:
			<div class="pl-4 text-sm">
				<p>1: 통일성과 완전성</p>
				<p>2: 이중성, 이원성, 변증법</p>
				<p>3: 균형, 삼위일체 - [에고, 이드, 초자아], [아버지, 아들, 성령]</p>
				<p>
					4: 안정성, 질서, 물질성, 보편성, 4가지 요소, 4가지 모서리, 4가지 유머
				</p>
				<p>5: 5개의 플라토닉 고체, 5개의 손가락, 5가지 감각, 5가지 요소, 정수</p>
				<p>6: 완벽함, 6일간의 창조, 기타의 6개의 줄</p>
				<p>
					7: 행운, 7가지 미덕, 7가지 대죄, 일주일의 7일, 불교의 7가지 보물
				</p>
			</div>
			숫자를 선택하고 그 숫자에 포함되는 분류를 최대한 많이 생각해 보세요. 시각적으로 모두 함께 매핑하세요.
		</li>
		<li class="mb-2">
			나만의 상상 속 성별 체계를 설명하고 지도를 그려보세요. 그리고 이 새로운 체계에 따라 방에 있는 모든 물건의 성별을 분류하고 시각적으로 표현해보세요.
		</li>
		<li class="mb-2">
			역사적/문화적 참고 자료에서 가져오거나 직접 만든 신성한 기하학을 바탕으로 포스터를 만들어 보세요.
		</li>
		<li class="mb-2">
			공상 과학이나 판타지 작가가 된 것처럼 나만의 마술 시스템을 만들어 시각적으로 표현해 보세요. 시작하는 데 도움이 되는 글쓰기 워크시트가 온라인에 마련되어 있습니다.
		</li>
		<li class="mb-2">
			좋아하는 단어나 문구의 목록을 만든 다음, 그 단어들이 서로 어떻게 연관되어 있는지 매핑하거나 그래프로 그려보세요. 대립과 연합을 만들어 보세요. 이 단어들이 다른 기존 구조에 어떻게 매핑되는지 실험해 보세요. (예: 어떤 단어는 담담하고, 어떤 단어는 다혈질이고, 우울하고, 낙천적인가? 또는 주요 아르카나의 각 타로 카드와 어떤 단어를 연관시킬 수 있을까요? 아니면 향기를 분류하는 차트에 단어를 매핑해 보세요: 어떤 단어에서 꽃 냄새가 나나요? 어떤 단어에서 우디 냄새가 나나요? 어떤 단어에서 머스크한 냄새가 나나요? 아니면 어떤 단어는 새, 어떤 단어는 파충류, 어떤 단어는 포유류, 어떤 단어는 벌레, 어떤 단어는 버섯인가요?)
		</li>
		<li class="mb-2">
			분류의 각 요소에서 영감을 받은 기호, 아이콘, 캐릭터 또는 문자 형태를 그려보세요(예: 그리스 신화에 나오는 9명의 뮤즈(서사시, 역사, 사랑시, 음악, 비극, 찬송가, 무용, 희극, 천문학)의 각 영역에 대한 캐릭터나 상징을 그리거나 전체 포스터를 만들 수도 있습니다).
		</li>
		<li class="mb-2">
			기존에 있는 그래프, 차트, 다이어그램을 찾아보세요. 모든 텍스트를 제거하고 레이블을
모두 다시 지정합니다.
		</li>
		<li class="mb-2">
			발견한 단어나 문구를 수집하세요(대화, 문자 메시지, 시의 한 구절 등 어디서든 찾을 수 있습니다). 이를 이미지의 캡션으로 사용해보세요. 어떤 연결점을 만들고 있는지를 염두에 두세요. 이러한 이미지와 캡션을 포스터나 출판물, 웹사이트(또는 다른 형식)에 어떤 식으로든 계층적/체계적으로 배치하세요.
		</li>
		<li class="mb-2">
			나만의 마이크로 장르를 만들어 보세요. -펑크, -웨이브 또는 -코어 등 나만의 장르를 만들어 보세요. 이 마이크로 장르가 묘사하는 세상을 상상해 보세요. 이 세계를 위한 그래픽 언어를 구체화해 보세요.
		</li>
		<li class="mb-2">
			좋아하는 앨범의 모든 노래 제목에 커스텀 기호, 아이콘, 일러스트레이션 또는 로고타입을 그려 보세요.
		</li>
		<li class="mb-2">
			캐릭터를 만들어서 다음 달 동안 만드는 모든 것에 어떤 식으로든 캐릭터를 적용해 보세요. 그리고 시간이 지나면서 친구들을 만들어주세요. 캐릭터의 세계를 만들어 보세요.

		</li>
	</ol>
</Paragraph>
